In [1]:
# importing all required libraries
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline

#### Q.1.Try fillna with "genre" and "rating".

##### Using Genre

First we will implement with genre, as we know we have null values in revenue (millions) and metascore columns,so we will replace those null values with mean of their corresoponding genre.

##### Replacing nan value in revenue (millions)

In [2]:
# creating pandas dataframe
original_dataframe=pd.read_csv("IMDB-Movie-Data.csv")

In [3]:
# converting all column names into lower case
original_dataframe.columns=[col.lower() for col in original_dataframe]

In [4]:
# getting columns name in our dataframe
original_dataframe.columns

Index(['rank', 'title', 'genre', 'description', 'director', 'actors', 'year',
       'runtime (minutes)', 'rating', 'votes', 'revenue (millions)',
       'metascore'],
      dtype='object')

In [5]:
original_dataframe.head()

,rank,title,genre,description,director,actors,year,runtime (minutes),rating,votes,revenue (millions),metascore
0,1,Guardians of the Galaxy,"Action,Adventure,Sci-Fi",A group of intergalactic criminals are forced ...,James Gunn,"Chris Pratt, Vin Diesel, Bradley Cooper, Zoe S...",2014,121,8.1,757074,333.13,76.0
1,2,Prometheus,"Adventure,Mystery,Sci-Fi","Following clues to the origin of mankind, a te...",Ridley Scott,"Noomi Rapace, Logan Marshall-Green, Michael Fa...",2012,124,7.0,485820,126.46,65.0
2,3,Split,"Horror,Thriller",Three girls are kidnapped by a man with a diag...,M. Night Shyamalan,"James McAvoy, Anya Taylor-Joy, Haley Lu Richar...",2016,117,7.3,157606,138.12,62.0
3,4,Sing,"Animation,Comedy,Family","In a city of humanoid animals, a hustling thea...",Christophe Lourdelet,"Matthew McConaughey,Reese Witherspoon, Seth Ma...",2016,108,7.2,60545,270.32,59.0
4,5,Suicide Squad,"Action,Adventure,Fantasy",A secret government agency recruits some of th...,David Ayer,"Will Smith, Jared Leto, Margot Robbie, Viola D...",2016,123,6.2,393727,325.02,40.0

In [6]:
# getting information of data values in dataframe
original_dataframe.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 12 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   rank                1000 non-null   int64
 1   title               1000 non-null   object
 2   genre               1000 non-null   object
 3   description         1000 non-null   object
 4   director            1000 non-null   object
 5   actors              1000 non-null   object
 6   year                1000 non-null   int64
 7   runtime (minutes)   1000 non-null   int64
 8   rating              1000 non-null   float64
 9   votes               1000 non-null   int64
 10  revenue (millions)  872 non-null    float64
 11  metascore           936 non-null    float64
dtypes: float64(3), int64(4), object(5)
memory usage: 93.9+ KB

If we observe above output, we can see that there are null values in revenue (millions) and metascore,our task is to replace these null values on the basis of genre and rating.First we will go for using genre.

In [7]:
# the genre column contains following data points
# it shows that we dont have null values in genre
# if present first we have to replace those with some 
# appropriate value
original_dataframe["genre"]

0       Action,Adventure,Sci-Fi
1      Adventure,Mystery,Sci-Fi
2               Horror,Thriller
3       Animation,Comedy,Family
4      Action,Adventure,Fantasy
                 ...
995         Crime,Drama,Mystery
996                      Horror
997         Drama,Music,Romance
998            Adventure,Comedy
999       Comedy,Family,Fantasy
Name: genre, Length: 1000, dtype: object

In [8]:
# we get length of genre column
# it is one series
original_dataframe["genre"].count()

1000

In [9]:
# getting unique values count of genre column
# there are total 207 genre
original_dataframe["genre"].value_counts()

Action,Adventure,Sci-Fi     50
Drama                       48
Comedy,Drama,Romance        35
Comedy                      32
Drama,Romance               31
                            ..
Drama,Fantasy,Mystery        1
Adventure,Drama              1
Comedy,Family,Romance        1
Adventure,Biography          1
Fantasy,Mystery,Thriller     1
Name: genre, Length: 207, dtype: int64

groupby() function is used to split the data into groups based on some criteria. Pandas objects can be split on any of their axes. The abstract definition of grouping is to provide a mapping of labels to group names.

In [10]:
# grouping by "genre" and taking mean of "revenue (millions)"
genre_group_revenue=original_dataframe.groupby("genre",as_index=False)["revenue (millions)"].mean()
# print(genre_group)
# print(type(genre_group))
# we got 207 rows ,as we have 207 genre
# without as_index=False, it returns a Series instead

In [11]:
# we can observe genre and its corresponding mean
genre_group_revenue.head()

                        genre  revenue (millions)
0                      Action          131.560000
1            Action,Adventure          223.740000
2  Action,Adventure,Biography           16.500000
3     Action,Adventure,Comedy           95.733571
4      Action,Adventure,Crime           90.620000

In [12]:
# we got genre and mean revenue (millions)
genre_group_revenue.columns

Index(['genre', 'revenue (millions)'], dtype='object')

In [13]:
# mean revenue (millions) values
genre_group_revenue["revenue (millions)"]

0      131.560000
1      223.740000
2       16.500000
3       95.733571
4       90.620000
          ...
202     62.450000
203     20.760000
204     64.510000
205      0.320000
206           NaN
Name: revenue (millions), Length: 207, dtype: float64

In [14]:
#genre_group_revenue

In [15]:
# it gives null value count in each column
genre_group_revenue.isnull().sum()

genre                  0
revenue (millions)    12
dtype: int64

First we need to replace those null values in revenue (millions) with the mean of values of revenue (millions)

In [16]:
# this gives genre name and its corresonding mean value
# we can observe some mean have nan value
for i in genre_group_revenue.index:
    print(genre_group_revenue["genre"][i],genre_group_revenue["revenue (millions)"][i])

Action 131.56
Action,Adventure 223.73999999999998
Action,Adventure,Biography 16.5
Action,Adventure,Comedy 95.73357142857141
Action,Adventure,Crime 90.62
Action,Adventure,Drama 77.32166666666666
Action,Adventure,Family 112.86666666666666
Action,Adventure,Fantasy 201.85730769230776
Action,Adventure,Horror 131.24
Action,Adventure,Mystery 150.344
Action,Adventure,Romance 23.47
Action,Adventure,Sci-Fi 209.23020000000005
Action,Adventure,Thriller 158.12363636363636
Action,Adventure,Western 91.33500000000001
Action,Biography,Crime 0.1
Action,Biography,Drama 100.65285714285713
Action,Comedy 58.79
Action,Comedy,Crime 92.41083333333334
Action,Comedy,Drama 2.87
Action,Comedy,Family 78.75
Action,Comedy,Fantasy 55.873333333333335
Action,Comedy,Horror 3.64
Action,Comedy,Mystery 23.62
Action,Comedy,Romance 27.395
Action,Comedy,Sci-Fi 26.0
Action,Comedy,Sport 148.21
Action,Crime,Drama 84.13125000000001
Action,Crime,Fantasy 134.57
Action,Crime,Mystery 67.37
Action,Crime,Sci-Fi 58.61
Action,Crime,Sport 28.77
Action,Crime,Thriller 109.16272727272727
Action,Drama,Family 131.025
Action,Drama,Fantasy 81.93666666666667
Action,Drama,History 34.473333333333336
Action,Drama,Horror 2.13
Action,Drama,Mystery 107.5
Action,Drama,Romance 39.725
Action,Drama,Sci-Fi 61.71666666666667
Action,Drama,Sport 19.25
Action,Drama,Thriller 42.73499999999999
Action,Drama,War 85.71
Action,Fantasy 36.38
Action,Fantasy,Horror 44.55333333333334
Action,Fantasy,Thriller 115.8
Action,Fantasy,War 210.59
Action,Horror nan
Action,Horror,Mystery 10.33
Action,Horror,Romance 10.91
Action,Horror,Sci-Fi 54.004
Action,Horror,Thriller 17.595
Action,Mystery,Sci-Fi 57.345
Action,Mystery,Thriller 129.78
Action,Sci-Fi 232.77999999999997
Action,Sci-Fi,Thriller 73.25
Action,Thriller 137.13625
Action,Thriller,War 42.72
Adventure 0.15
Adventure,Biography nan
Adventure,Biography,Crime 10.14
Adventure,Biography,Drama 20.01
Adventure,Comedy 58.88
Adventure,Comedy,Drama 37.973749999999995
Adventure,Comedy,Family 96.875
Adventure,Comedy,Fantasy 21.56
Adventure,Comedy,Horror 75.59
Adventure,Comedy,Romance 63.635000000000005
Adventure,Comedy,Sci-Fi 18.904999999999998
Adventure,Crime,Mystery 38.56
Adventure,Drama 0.06
Adventure,Drama,Family 151.8225
Adventure,Drama,Fantasy 276.008
Adventure,Drama,History 7.08
Adventure,Drama,Horror 66.01
Adventure,Drama,Romance 74.78
Adventure,Drama,Sci-Fi 208.21
Adventure,Drama,Thriller 82.74333333333333
Adventure,Drama,War 120.52
Adventure,Drama,Western 171.03
Adventure,Family 42.65
Adventure,Family,Fantasy 157.24785714285716
Adventure,Fantasy 272.1566666666667
Adventure,Fantasy,Mystery 7.69
Adventure,Horror 7.19
Adventure,Horror,Mystery 46.98
Adventure,Mystery,Sci-Fi 138.645
Adventure,Sci-Fi,Thriller 180.55999999999997
Animation,Action,Adventure 195.47333333333333
Animation,Action,Comedy 148.34
Animation,Adventure,Comedy 221.33653846153845
Animation,Adventure,Family 135.915
Animation,Comedy,Drama 0.29
Animation,Comedy,Family 194.43
Animation,Drama,Fantasy 4.68
Animation,Drama,Romance nan
Animation,Family,Fantasy 75.28
Animation,Fantasy 0.92
Biography,Comedy,Crime 116.87
Biography,Comedy,Drama 34.98666666666667
Biography,Crime,Drama 48.042500000000004
Biography,Drama 53.39785714285714
Biography,Drama,Family 61.69
Biography,Drama,History 71.37307692307692
Biography,Drama,Mystery 35.71
Biography,Drama,Romance 15.05
Biography,Drama,Sport 73.80749999999999
Biography,Drama,Thriller 73.23333333333333
Biography,History,Thriller 2.96
Comedy 74.68499999999999
Comedy,Crime 85.53
Comedy,Crime,Drama 25.72714285714286
Comedy,Crime,Thriller 36.92
Comedy,Drama 33.035000000000004
Comedy,Drama,Family 89.62666666666667
Comedy,Drama,Fantasy 15.29
Comedy,Drama,Horror 2.0100000000000002
Comedy,Drama,Music 52.192499999999995
Comedy,Drama,Musical 38.51
Comedy,Drama,Romance 40.32181818181818
Comedy,Drama,Thriller 3.08
Comedy,Family 76.592
Comedy,Family,Fantasy 19.64
Comedy,Family,Musical 143.7
Comedy,Family,Romance 59.57
Comedy,Fantasy 160.05
Comedy,Fantasy,Horror 41.519999999999996
Comedy,Fantasy,Romance 56.82
Comedy,Horror 8.209999999999999
Comedy,Horror,Romance 66.36
Comedy,Horror,Sci-Fi 7.77
Comedy,Horror,Thriller 45.035
Comedy,Music 96.41499999999999
Comedy,Music,Romance 65.0
Comedy,Mystery 30.0
Comedy,Romance 53.004782608695656
Comedy,Romance,Sport 2.34
Comedy,Romance,Western 42.62
Comedy,Sci-Fi nan
Comedy,Western nan
Crime,Drama 35.84375
Crime,Drama,Fantasy 2.21
Crime,Drama,History 39.019999999999996
Crime,Drama,Horror 1.29
Crime,Drama,Music 65.27
Crime,Drama,Mystery 38.92333333333334
Crime,Drama,Thriller 41.93388888888889
Crime,Horror,Thriller 30.84
Crime,Mystery,Thriller 117.7
Crime,Thriller 117.14
Drama 27.546451612903223
Drama,Family nan
Drama,Family,Fantasy 201.15
Drama,Family,Music 1.2
Drama,Fantasy 8.515
Drama,Fantasy,Horror 8.037999999999998
Drama,Fantasy,Music 50.46
Drama,Fantasy,Musical 24.34
Drama,Fantasy,Mystery 42.27
Drama,Fantasy,Romance 95.21749999999999
Drama,Fantasy,Thriller 43.98
Drama,Fantasy,War 37.62
Drama,History 40.22
Drama,History,Thriller 53.897499999999994
Drama,History,War 0.86
Drama,Horror 9.275
Drama,Horror,Musical 52.88
Drama,Horror,Mystery 38.52333333333333
Drama,Horror,Sci-Fi 58.68599999999999
Drama,Horror,Thriller 16.11
Drama,Music 20.30666666666667
Drama,Music,Romance 30.799999999999997
Drama,Musical,Romance 148.78
Drama,Mystery,Romance 27.98833333333333
Drama,Mystery,Sci-Fi 37.547999999999995
Drama,Mystery,Thriller 19.584999999999997
Drama,Mystery,War 6.86
Drama,Romance 30.683666666666657
Drama,Romance,Sci-Fi 17.7525
Drama,Romance,Thriller 118.75
Drama,Romance,War nan
Drama,Sci-Fi 18.62
Drama,Sci-Fi,Thriller 103.12666666666667
Drama,Sport 77.46666666666665
Drama,Thriller 27.6375
Drama,Thriller,War 18.7
Drama,War 5.375
Drama,Western 162.8
Fantasy,Horror 63.11
Fantasy,Horror,Thriller nan
Fantasy,Mystery,Thriller nan
Horror 37.05285714285714
Horror,Mystery 25.635
Horror,Mystery,Sci-Fi 0.15
Horror,Mystery,Thriller 72.57
Horror,Sci-Fi,Thriller 34.165
Horror,Thriller 34.04083333333333
Mystery,Romance,Sci-Fi 54.7
Mystery,Romance,Thriller 5.98
Mystery,Sci-Fi,Thriller 68.76333333333334
Mystery,Thriller 73.53333333333333
Mystery,Thriller,Western nan
Romance,Sci-Fi nan
Romance,Sci-Fi,Thriller 62.45
Sci-Fi 20.76
Sci-Fi,Thriller 64.51
Thriller 0.32
Thriller,War nan

In [17]:
# calculating mean value of revenue (millions)
mean_revenue_value=genre_group_revenue["revenue (millions)"].mean()

In [18]:
# mean value of revenue
mean_revenue_value

66.02433967963796

In [19]:
# replacing nan values with mean value of revenue (millions)
genre_group_revenue["revenue (millions)"].fillna(mean_revenue_value,inplace=True)

In [20]:
# now we can observe there are no nan values in revenue (millions)
genre_group_revenue.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 207 entries, 0 to 206
Data columns (total 2 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   genre               207 non-null    object
 1   revenue (millions)  207 non-null    float64
dtypes: float64(1), object(1)
memory usage: 14.9+ KB

In [21]:
# I have to create dictionary with genre and revenue value without any null value
# created dictionary which has genre name as key and its corresponding mean revenue (millions) value 
# is its value
data_dict={}
for i in genre_group_revenue.index:
    data_dict[genre_group_revenue["genre"][i]]=genre_group_revenue["revenue (millions)"][i]
#print(data_dict)

Next task is ,I want ot traverse on original dataframe and replace null values in revenue (millions) attribute with corresponding mean value of genre.

In [22]:
# it traverse on every row
# observe here we are doing changes in original dataframe 
for i in original_dataframe.index:
    # if revenue value is null then replace it with mean value of its corresponding genre
    # for this we are using our database that is data_dict
    if pd.isnull(original_dataframe["revenue (millions)"][i]):
        original_dataframe["revenue (millions)"][i]=data_dict[original_dataframe["genre"][i]] 
        #print(original_dataframe["genre"][i],data_dict[original_dataframe["genre"][i]])

c:\users\tejaswita\appdata\local\programs\python\python37\lib\site-packages\ipykernel_launcher.py:7: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  import sys

In [23]:
# now we can see that we dont have null values in revenue column
# in original dataframe
original_dataframe.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 12 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   rank                1000 non-null   int64
 1   title               1000 non-null   object
 2   genre               1000 non-null   object
 3   description         1000 non-null   object
 4   director            1000 non-null   object
 5   actors              1000 non-null   object
 6   year                1000 non-null   int64
 7   runtime (minutes)   1000 non-null   int64
 8   rating              1000 non-null   float64
 9   votes               1000 non-null   int64
 10  revenue (millions)  1000 non-null   float64
 11  metascore           936 non-null    float64
dtypes: float64(3), int64(4), object(5)
memory usage: 93.9+ KB

##### Replacing nan value in metascore column

In [24]:
# splitting dataset into groups
# and taking mean of metascore
genre_group_metascore=original_dataframe.groupby("genre",as_index=False)["metascore"].mean()
print(genre_group_metascore)
print(type(genre_group_metascore))
# we got 207 rows ,as we have 207 genre
# without as_index=False, it returns a Series instead

                          genre  metascore
0                        Action  37.000000
1              Action,Adventure  57.333333
2    Action,Adventure,Biography  62.500000
3       Action,Adventure,Comedy  47.214286
4        Action,Adventure,Crime  48.333333
..                          ...        ...
202     Romance,Sci-Fi,Thriller        NaN
203                      Sci-Fi  53.000000
204             Sci-Fi,Thriller  34.000000
205                    Thriller  59.714286
206                Thriller,War  40.000000

[207 rows x 2 columns]
<class 'pandas.core.frame.DataFrame'>

In [25]:
genre_group_metascore.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 207 entries, 0 to 206
Data columns (total 2 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   genre      207 non-null    object
 1   metascore  200 non-null    float64
dtypes: float64(1), object(1)
memory usage: 4.9+ KB

above output shows that we got 200 mean of metascore,we have 7 null value for metascore, we will replace those nan values with mean of mean of corresponding metascore

In [26]:
# calculating mean of metascore
mean_value_metascore=genre_group_metascore["metascore"].mean()

In [27]:
# mean value
mean_value_metascore

58.624719921182134

In [28]:
# filling nan values of metascore column with metascore mean value
genre_group_metascore["metascore"].fillna(mean_value_metascore,inplace=True)

In [29]:
# now we can see there is no nan value in metascore column
genre_group_metascore.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 207 entries, 0 to 206
Data columns (total 2 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   genre      207 non-null    object
 1   metascore  207 non-null    float64
dtypes: float64(1), object(1)
memory usage: 4.9+ KB

In [30]:
# I have to create dictionary with genre and metascore value without any null value
metascore_data_dict={}
for i in genre_group_metascore.index:
    metascore_data_dict[genre_group_metascore["genre"][i]]=genre_group_metascore["metascore"][i]
#print(metascore_data_dict)

In [31]:
# it traverse on every row
# it replaces nan values in original dataframe with mean of metascore corresponding to its genre
for i in original_dataframe.index:
    if pd.isnull(original_dataframe["metascore"][i]):
        original_dataframe["metascore"][i]=metascore_data_dict[original_dataframe["genre"][i]]

c:\users\tejaswita\appdata\local\programs\python\python37\lib\site-packages\ipykernel_launcher.py:5: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """

In [32]:
# if we observe original dataframe info
# there are no null values in metascore column
original_dataframe.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 12 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   rank                1000 non-null   int64
 1   title               1000 non-null   object
 2   genre               1000 non-null   object
 3   description         1000 non-null   object
 4   director            1000 non-null   object
 5   actors              1000 non-null   object
 6   year                1000 non-null   int64
 7   runtime (minutes)   1000 non-null   int64
 8   rating              1000 non-null   float64
 9   votes               1000 non-null   int64
 10  revenue (millions)  1000 non-null   float64
 11  metascore           1000 non-null   float64
dtypes: float64(3), int64(4), object(5)
memory usage: 93.9+ KB

##### Using Rating

Now we will implement with rating, as we know we have null values in revenue (millions) and metascore columns,so we will replace those null values with mean of their corresoponding rating.

##### Replacing nan values in revenue (millions) column

In [33]:
# creating pandas dataframe
original_dataframe_rating=pd.read_csv("IMDB-Movie-Data.csv")

In [34]:
# converting all column names into lower case
original_dataframe_rating.columns=[col.lower() for col in original_dataframe_rating]

In [35]:
# getting names of columns
original_dataframe_rating.columns

Index(['rank', 'title', 'genre', 'description', 'director', 'actors', 'year',
       'runtime (minutes)', 'rating', 'votes', 'revenue (millions)',
       'metascore'],
      dtype='object')

In [36]:
# observe nan values, these are present in revenue (millions) and metascore column
original_dataframe_rating.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 12 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   rank                1000 non-null   int64
 1   title               1000 non-null   object
 2   genre               1000 non-null   object
 3   description         1000 non-null   object
 4   director            1000 non-null   object
 5   actors              1000 non-null   object
 6   year                1000 non-null   int64
 7   runtime (minutes)   1000 non-null   int64
 8   rating              1000 non-null   float64
 9   votes               1000 non-null   int64
 10  revenue (millions)  872 non-null    float64
 11  metascore           936 non-null    float64
dtypes: float64(3), int64(4), object(5)
memory usage: 93.9+ KB

In [37]:
rating_group_revenue=original_dataframe_rating.groupby("rating",as_index=False)["revenue (millions)"].mean()
# print(rating_group_revenue)
# print(type(rating_group_revenue))
# without as_index=False, it returns a Series instead

In [38]:
rating_group_revenue.head()

   rating  revenue (millions)
0     1.9               14.17
1     2.7                9.35
2     3.2                 NaN
3     3.5                 NaN
4     3.7                 NaN

In [39]:
rating_group_revenue.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 55 entries, 0 to 54
Data columns (total 2 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   rating              55 non-null     float64
 1   revenue (millions)  50 non-null     float64
dtypes: float64(2)
memory usage: 1.3 KB

Above output shows that we have 5 nan values in revenue (millions) column.We need to replace those with mean value of revenue (millions)

In [40]:
# taking mean of revenue (millions)
mean_revenue_value=rating_group_revenue["revenue (millions)"].mean()

In [41]:
# filling nan value with mean value
rating_group_revenue["revenue (millions)"].fillna(mean_revenue_value,inplace=True)

In [42]:
# now is shows that revenue (millions) has no nan value
rating_group_revenue.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 55 entries, 0 to 54
Data columns (total 2 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   rating              55 non-null     float64
 1   revenue (millions)  55 non-null     float64
dtypes: float64(2)
memory usage: 1.3 KB

In [43]:
# I have to create dictionary with rating and revenue (millions) mean value without any null value
revenue_data_dict={}
for i in rating_group_revenue.index:
    revenue_data_dict[rating_group_revenue["rating"][i]]=rating_group_revenue["revenue (millions)"][i]
# print(revenue_data_dict)

In [44]:
# it traverse on every row
# it replaces nan values in original dataframe with mean of revenue (millions) corresponding to its rating
for i in original_dataframe_rating.index:
    if pd.isnull(original_dataframe_rating["revenue (millions)"][i]):
        original_dataframe_rating["revenue (millions)"][i]=revenue_data_dict[original_dataframe_rating["rating"][i]]

c:\users\tejaswita\appdata\local\programs\python\python37\lib\site-packages\ipykernel_launcher.py:5: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """

In [45]:
original_dataframe_rating.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 12 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   rank                1000 non-null   int64
 1   title               1000 non-null   object
 2   genre               1000 non-null   object
 3   description         1000 non-null   object
 4   director            1000 non-null   object
 5   actors              1000 non-null   object
 6   year                1000 non-null   int64
 7   runtime (minutes)   1000 non-null   int64
 8   rating              1000 non-null   float64
 9   votes               1000 non-null   int64
 10  revenue (millions)  1000 non-null   float64
 11  metascore           936 non-null    float64
dtypes: float64(3), int64(4), object(5)
memory usage: 93.9+ KB

##### Replacing nan value in metascore column

In [46]:
rating_group_metascore=original_dataframe_rating.groupby("rating",as_index=False)["metascore"].mean()
# print(rating_group_metascore)
# print(type(rating_group_metascore))
# without as_index=False, it returns a Series instead

In [47]:
rating_group_metascore.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 55 entries, 0 to 54
Data columns (total 2 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   rating     55 non-null     float64
 1   metascore  55 non-null     float64
dtypes: float64(2)
memory usage: 1.3 KB

In [48]:
#rating_group_metascore["metascore"]

In [49]:
# I have to create dictionary with rating and metascore mean value without any null value
metascore_data_dict={}
for i in rating_group_metascore.index:
    metascore_data_dict[rating_group_metascore["rating"][i]]=rating_group_metascore["metascore"][i]
#print(metascore_data_dict)

In [50]:
# it traverse on every row
# it replaces nan values in original dataframe with mean of metascore corresponding to its rating
for i in original_dataframe_rating.index:
    if pd.isnull(original_dataframe_rating["metascore"][i]):
        original_dataframe_rating["metascore"][i]=metascore_data_dict[original_dataframe_rating["rating"][i]]

c:\users\tejaswita\appdata\local\programs\python\python37\lib\site-packages\ipykernel_launcher.py:5: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """

In [51]:
# now there are no null values in dataframe 
original_dataframe_rating.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 12 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   rank                1000 non-null   int64
 1   title               1000 non-null   object
 2   genre               1000 non-null   object
 3   description         1000 non-null   object
 4   director            1000 non-null   object
 5   actors              1000 non-null   object
 6   year                1000 non-null   int64
 7   runtime (minutes)   1000 non-null   int64
 8   rating              1000 non-null   float64
 9   votes               1000 non-null   int64
 10  revenue (millions)  1000 non-null   float64
 11  metascore           1000 non-null   float64
dtypes: float64(3), int64(4), object(5)
memory usage: 93.9+ KB